In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[1,2,3],
                   [None,5,6],
                   [None,8,9],
                   [10,11,12]
                   ], 
                  columns=["A", "B", "C"], 
                  index=["x","y","z",'zz'])

In [4]:
df

       A   B   C
x    1.0   2   3
y    NaN   5   6
z    NaN   8   9
zz  10.0  11  12

In [5]:
df.head(2)

     A  B  C
x  1.0  2  3
y  NaN  5  6

In [6]:
df.tail(2)

       A   B   C
z    NaN   8   9
zz  10.0  11  12

In [7]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [8]:
df.index

Index(['x', 'y', 'z', 'zz'], dtype='object')

In [9]:
df.index.tolist()

['x', 'y', 'z', 'zz']

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x to zz
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 128.0+ bytes

In [11]:
df.describe()

               A          B          C
count   2.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     6.363961   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [14]:
df

       A   B   C
x    1.0   2   3
y    NaN   5   6
z    NaN   8   9
zz  10.0  11  12

In [12]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.nunique(axis=1) # per row

x     3
y     2
z     2
zz    3
dtype: int64

In [15]:
df.nunique(axis=0) # per column

A    2
B    4
C    4
dtype: int64

In [16]:
df['A']

x      1.0
y      NaN
z      NaN
zz    10.0
Name: A, dtype: float64

In [17]:
df['A'].unique()

array([ 1., nan, 10.])

In [18]:
df

       A   B   C
x    1.0   2   3
y    NaN   5   6
z    NaN   8   9
zz  10.0  11  12

In [19]:
df.shape

(4, 3)

In [20]:
df.size

12

In [24]:
coffee = pd.read_csv('coffee.csv')
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [25]:
coffee.index

RangeIndex(start=0, stop=14, step=1)

In [ ]:
results = pd.read_parquet('results.parquet')
bios = pd.read_csv('bios.csv')
olympics_data = pd.read_excel('olympics-data.xlsx', sheet_name="results")

In [ ]:
coffee.sample(5)

          Day Coffee Type  Units Sold
5   Wednesday       Latte          25
8      Friday    Espresso          45
9      Friday       Latte          35
1      Monday       Latte          15
12     Sunday    Espresso          45

In [62]:
coffee.head(1)

      Day Coffee Type  Units Sold
0  Monday    Espresso          25

In [ ]:
coffee.loc[0:1, :]  # label based indexing

      Day Coffee Type  Units Sold
0  Monday    Espresso          25
1  Monday       Latte          15

In [33]:
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [36]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [34]:
coffee.loc[[0 ,1, 5]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
5  Wednesday       Latte          25

In [37]:
coffee.loc[[0, 2], ["Day", "Units Sold"]]

       Day  Units Sold
0   Monday          25
2  Tuesday          30

In [38]:
coffee.loc[:, ["Day", "Units Sold"]]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [39]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [40]:
coffee.iloc[:, [0,2]] # integer based indexing

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [42]:
coffee.loc[0:2, :]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [41]:
coffee.iloc[0:2, :] # integer based indexing

      Day Coffee Type  Units Sold
0  Monday    Espresso          25
1  Monday       Latte          15

In [43]:
coffee["Day"]

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [63]:
coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [45]:
coffee.index

RangeIndex(start=0, stop=14, step=1)

In [46]:
coffee.index = coffee["Day"]

In [47]:
coffee

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [48]:
coffee.loc["Monday":"Wednesday"]

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25

In [49]:
coffee = pd.read_csv('coffee.csv')
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [50]:
coffee.loc[1:3, "Units Sold"] = 10

In [51]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [53]:
coffee.at[0, "Units Sold"] # label based indexing

25

In [56]:
coffee.iat[0, 2]

25

In [58]:
coffee.at[13, "Units Sold"] # label based indexing

35

In [61]:
coffee.iat[12, 2] # label based indexing

45

In [64]:
coffee.loc[:2, ["Day", "Units Sold"]]

       Day  Units Sold
0   Monday          25
1   Monday          10
2  Tuesday          10

In [65]:
coffee.iloc[:2, [0, 2]]

      Day  Units Sold
0  Monday          25
1  Monday          10

In [66]:
coffee.loc[:, ["Units Sold"]]

    Units Sold
0           25
1           10
2           10
3           10
4           35
5           25
6           40
7           30
8           45
9           35
10          45
11          35
12          45
13          35

In [67]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [70]:
coffee_sorted = coffee.sort_values(by="Units Sold", ascending=False)
coffee_sorted

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10

In [75]:
coffee_sorted.loc[:2, ['Coffee Type']]  # :2 means "from start through label 2"

   Coffee Type
8     Espresso
10    Espresso
12    Espresso
6     Espresso
4     Espresso
9        Latte
11       Latte
13       Latte
7        Latte
0     Espresso
5        Latte
1        Latte
2     Espresso

In [76]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[False, True])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          10
1      Monday       Latte          10
3     Tuesday       Latte          10

In [105]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [109]:
for index, row in coffee.iterrows():
    # print(index)
    print(row)
    # print("Coffee Type of Row:", row["Coffee Type"])

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object
Day            Monday
Coffee Type     Latte
Units Sold         10
Name: 1, dtype: object
Day             Tuesday
Coffee Type    Espresso
Units Sold           10
Name: 2, dtype: object
Day            Tuesday
Coffee Type      Latte
Units Sold          10
Name: 3, dtype: object
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

## Filtering Data

In [2]:
import pandas as pd
bios = pd.read_csv('bios.csv')

In [4]:
bios.head(2)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN

In [5]:
bios.columns

Index(['athlete_id', 'name', 'born_date', 'born_city', 'born_region',
       'born_country', 'NOC', 'height_cm', 'weight_kg', 'died_date'],
      dtype='object')

In [10]:
# bios["height_cm"]

In [14]:
bios.loc[bios["height_cm"] > 215][:5]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,So Paulo,So Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,Mnchen (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN

In [15]:
bios.loc[bios["height_cm"] > 215, ["name", "height_cm"]][:5]

                       name  height_cm
5089     Viktor Pankrashkin      220.0
5583   Paulinho Villas Boas      217.0
5673         Gunther Behnke      221.0
5716               Uwe Blab      218.0
5781         Tommy Burleson      223.0

#### Short-hand syntax (without .loc)

In [18]:
bios[["name", "height_cm", "born_country"]]

                         name  height_cm born_country
0       Jean-Franois Blanchy        NaN          FRA
1              Arnaud Boetsch      183.0          FRA
2                Jean Borotra      183.0          FRA
3             Jacques Brugnon      168.0          FRA
4                Albert Canet        NaN          GBR
...                       ...        ...          ...
145495      Polina Luchnikova      167.0          RUS
145496    Valeriya Merkusheva      168.0          RUS
145497        Yuliya Smirnova      163.0          RUS
145498         Andr Foussard      166.0          FRA
145499          Bill Phillips        NaN          AUS

[145500 rows x 3 columns]

In [20]:
bios[bios['height_cm'] > 215][:5]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,So Paulo,So Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,Mnchen (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN

In [22]:
bios[bios['height_cm'] > 215][["name", "height_cm"]][:5]

                       name  height_cm
5089     Viktor Pankrashkin      220.0
5583   Paulinho Villas Boas      217.0
5673         Gunther Behnke      221.0
5716               Uwe Blab      218.0
5781         Tommy Burleson      223.0

#### Multiple filter conditions

In [24]:
bios[(bios['height_cm'] > 215) & (bios['born_country'] == 'USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

#### Filter by string conditions

In [25]:
bios['name']

0         Jean-Franois Blanchy
1                Arnaud Boetsch
2                  Jean Borotra
3               Jacques Brugnon
4                  Albert Canet
                  ...
145495        Polina Luchnikova
145496      Valeriya Merkusheva
145497          Yuliya Smirnova
145498           Andr Foussard
145499            Bill Phillips
Name: name, Length: 145500, dtype: object

In [29]:
bios[bios['name'].str.contains("keith", case=False)][:2]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31

In [36]:
# Regex syntax
bios[bios['name'].str.contains('keith | patrick', case=False)][:2]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31

In [ ]:
# Don't use regex search (exact match)  # regular expression  substring
bios[bios['name'].str.contains('keith | patrick', case=False, regex=False)]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

In [39]:
## isin method & startswith
bios[bios['born_country'].isin(["USA", "FRA", "GBR"]) & (bios['name'].str.startswith("Keith"))][:2]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22

## Adding / Removing Columns

In [41]:
coffee = pd.read_csv('coffee.csv')
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [42]:
coffee.columns

Index(['Day', 'Coffee Type', 'Units Sold'], dtype='object')

In [43]:
coffee['price'] = 4.99

In [44]:
coffee.columns

Index(['Day', 'Coffee Type', 'Units Sold', 'price'], dtype='object')

In [45]:
coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [46]:
import numpy as np
import pandas as pd

coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)

In [47]:
coffee

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25   4.99       3.99
1      Monday       Latte          15   4.99       5.99
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       5.99
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       5.99
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       5.99
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       5.99
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       5.99
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       5.99

In [48]:
coffee.drop(columns=['price'], inplace=True)

# the below would also have worked
# coffee = coffee.drop(columns=['price'])

In [49]:
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       5.99

In [50]:
coffee = coffee[['new_price', 'Day', 'Coffee Type', 'Units Sold']]

In [51]:
coffee

    new_price        Day Coffee Type  Units Sold
0        3.99     Monday    Espresso          25
1        5.99     Monday       Latte          15
2        3.99    Tuesday    Espresso          30
3        5.99    Tuesday       Latte          20
4        3.99  Wednesday    Espresso          35
5        5.99  Wednesday       Latte          25
6        3.99   Thursday    Espresso          40
7        5.99   Thursday       Latte          30
8        3.99     Friday    Espresso          45
9        5.99     Friday       Latte          35
10       3.99   Saturday    Espresso          45
11       5.99   Saturday       Latte          35
12       3.99     Sunday    Espresso          45
13       5.99     Sunday       Latte          35

In [52]:
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']

C:\Users\qslia\AppData\Local\Temp\ipykernel_14504\684017446.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']

In [53]:
coffee

    new_price        Day Coffee Type  Units Sold  revenue
0        3.99     Monday    Espresso          25    99.75
1        5.99     Monday       Latte          15    89.85
2        3.99    Tuesday    Espresso          30   119.70
3        5.99    Tuesday       Latte          20   119.80
4        3.99  Wednesday    Espresso          35   139.65
5        5.99  Wednesday       Latte          25   149.75
6        3.99   Thursday    Espresso          40   159.60
7        5.99   Thursday       Latte          30   179.70
8        3.99     Friday    Espresso          45   179.55
9        5.99     Friday       Latte          35   209.65
10       3.99   Saturday    Espresso          45   179.55
11       5.99   Saturday       Latte          35   209.65
12       3.99     Sunday    Espresso          45   179.55
13       5.99     Sunday       Latte          35   209.65

In [54]:
coffee.rename(columns={'new_price': 'price'}, inplace=True)

C:\Users\qslia\AppData\Local\Temp\ipykernel_14504\3835928051.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  coffee.rename(columns={'new_price': 'price'}, inplace=True)

In [55]:
coffee

    price        Day Coffee Type  Units Sold  revenue
0    3.99     Monday    Espresso          25    99.75
1    5.99     Monday       Latte          15    89.85
2    3.99    Tuesday    Espresso          30   119.70
3    5.99    Tuesday       Latte          20   119.80
4    3.99  Wednesday    Espresso          35   139.65
5    5.99  Wednesday       Latte          25   149.75
6    3.99   Thursday    Espresso          40   159.60
7    5.99   Thursday       Latte          30   179.70
8    3.99     Friday    Espresso          45   179.55
9    5.99     Friday       Latte          35   209.65
10   3.99   Saturday    Espresso          45   179.55
11   5.99   Saturday       Latte          35   209.65
12   3.99     Sunday    Espresso          45   179.55
13   5.99     Sunday       Latte          35   209.65

In [68]:
bios_new = bios.copy()

In [65]:
bios_new.head(2)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN

In [78]:
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]

In [79]:
bios_new[:3]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean

In [81]:
bios_new.query('first_name == "Keith"')[:2]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith

In [83]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

In [84]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])

In [86]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 13.3+ MB

In [89]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year

In [90]:
bios_new[:2]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime,born_year
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0

In [95]:
bios_new[['name', 'born_year']][:2]

                    name  born_year
0  Jean-Franois Blanchy     1886.0
1         Arnaud Boetsch     1969.0

In [96]:
bios_new.to_csv('bios_new.csv', index=False)

In [100]:
def categorize_athlete(x):
    if x < 165:
        return 'Short'
    elif x < 185:
        return 'Average'
    else:
        return 'Tall'

In [101]:
bios['height_category'] = bios['height_cm'].apply(categorize_athlete)

In [ ]:
def f(x):
    return x * 2

lambda x: x * 2

In [103]:
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

In [105]:
bios[:5]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall

In [106]:
def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 or row['weight_kg'] <= 80:
        return 'Middleweight'
    else:
        return 'Heavyweight'
    
bios['Category'] = bios.apply(categorize_athlete, axis=1)

In [107]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight

## Merging & Concatenating Data

In [108]:
nocs = pd.read_csv('noc_regions.csv')

In [109]:
nocs

     NOC       region                 notes
0    AFG  Afghanistan                   NaN
1    AHO      Curacao  Netherlands Antilles
2    ALB      Albania                   NaN
3    ALG      Algeria                   NaN
4    AND      Andorra                   NaN
..   ...          ...                   ...
225  YEM        Yemen                   NaN
226  YMD        Yemen           South Yemen
227  YUG       Serbia            Yugoslavia
228  ZAM       Zambia                   NaN
229  ZIM     Zimbabwe                   NaN

[230 rows x 3 columns]

In [110]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight
...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Average,Lightweight
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Average,Lightweight
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Short,Lightweight
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Average,Middleweight
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Tall,Heavyweight

In [135]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                   'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['fol', 'bar', 'baz', 'fol'],
                   'value': [5, 6, 7, 8]})
pd.merge(df1, df2, how='left',  left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  NaN      NaN
1  bar        2  bar      6.0
2  baz        3  baz      7.0
3  foo        5  NaN      NaN

In [134]:
pd.merge(df1, df2, how='inner', right_on='rkey', left_on='lkey')

  lkey  value_x rkey  value_y
0  bar        2  bar        6
1  baz        3  baz        7

In [122]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [130]:
bios.columns

Index(['athlete_id', 'name', 'born_date', 'born_city', 'born_region',
       'born_country', 'NOC', 'height_cm', 'weight_kg', 'died_date',
       'height_category', 'Category'],
      dtype='object')

In [132]:
nocs.columns

Index(['NOC', 'region', 'notes'], dtype='object')

In [129]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,Category,NOC_y,region,notes
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight,GBR,UK,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Average,Lightweight,RUS,Russia,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Average,Lightweight,RUS,Russia,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Short,Lightweight,RUS,Russia,NaN
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Average,Middleweight,FRA,France,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Tall,Heavyweight,AUS,Australia,NaN

In [139]:
bios_new['NOC_y'].isna()

0         False
1         False
2         False
3         False
4         False
          ...
145495    False
145496    False
145497    False
145498    False
145499    False
Name: NOC_y, Length: 145500, dtype: bool

In [140]:
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)

In [141]:
usa = bios[bios['born_country'] == 'USA'].copy()
gbr = bios[bios['born_country'] == 'GBR'].copy()

In [142]:
usa

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,Average,Middleweight
960,964,Xchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,Average,Lightweight
961,965,Anglica Gavaldn,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,Short,Lightweight
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,Tall,Heavyweight
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,Average,Lightweight
...,...,...,...,...,...,...,...,...,...,...,...,...
145445,149168,Kristen Santos,1994-11-02,Fairfield,Connecticut,USA,United States,NaN,NaN,NaN,Tall,Heavyweight
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN,Tall,Heavyweight
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN,Tall,Heavyweight
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN,Tall,Heavyweight
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN,Tall,Heavyweight

In [143]:
new_df = pd.concat([usa, gbr])

In [145]:
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,Average,Middleweight
960,964,Xchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,Average,Lightweight
961,965,Anglica Gavaldn,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,Short,Lightweight
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,Tall,Heavyweight
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,Average,Lightweight

In [144]:
new_df.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
144811,148512,Benjamin Alexander,1983-05-08,London,England,GBR,Jamaica,NaN,NaN,NaN,Tall,Heavyweight
144815,148517,Ashley Watson,1993-10-28,Peterborough,England,GBR,Jamaica,NaN,NaN,NaN,Tall,Heavyweight
145005,148716,Peder Kongshaug,2001-08-13,Wimbledon,England,GBR,Norway,184.0,86.0,NaN,Average,Middleweight
145319,149041,Axel Brown,1992-04-02,Harrogate,England,GBR,Trinidad and Tobago,NaN,NaN,NaN,Tall,Heavyweight
145388,149111,Jean-Luc Baker,1993-10-07,Burnley,England,GBR,United States,NaN,NaN,NaN,Tall,Heavyweight

In [148]:
combined_df = pd.merge(results, bios, on='athlete_id', how='left')

In [150]:
# combined_df

In [152]:
# combined_df.head()

## Handling Null Values

In [167]:
coffee = pd.read_csv('coffee.csv')
coffee.loc[[2, 3], 'Units Sold'] = np.nan

In [168]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso         NaN
3     Tuesday       Latte         NaN
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [169]:
# Make sure to set this to your Units Sold column if you want these changes to stick
coffee['Units Sold'].fillna(coffee['Units Sold'].mean())

0     25.000000
1     15.000000
2     34.166667
3     34.166667
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [170]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso         NaN
3     Tuesday       Latte         NaN
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [171]:
coffee['Units Sold']

0     25.0
1     15.0
2      NaN
3      NaN
4     35.0
5     25.0
6     40.0
7     30.0
8     45.0
9     35.0
10    45.0
11    35.0
12    45.0
13    35.0
Name: Units Sold, dtype: float64

In [172]:
# coffee['Units Sold'] = coffee['Units Sold'].interpolate()
coffee['Units Sold'].interpolate()

0     25.000000
1     15.000000
2     21.666667
3     28.333333
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [174]:
coffee.loc[[2, 3], 'Units Sold'] = np.nan
coffee.dropna(subset=['Units Sold']) # Use inplace=True if you want to update the coffee df

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [ ]:
coffee.dropna(subset=['Units Sold']) # Use inplace=True if you want to update the coffee df

In [175]:
coffee[coffee['Units Sold'].notna()]

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [ ]:
coffee

## Aggregating Data

In [176]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight

In [177]:
bios['born_city'].value_counts()

born_city
Budapest           1378
Moskva (Moscow)     883
Oslo                708
Stockholm           629
Praha (Prague)      600
                   ...
Bodrogkisfalud        1
Ternberg              1
Klaus                 1
Plaki                1
Dulwich Hill          1
Name: count, Length: 22368, dtype: int64

In [ ]:
bios[bios['born_country'] == 'USA']['born_region'].value_counts().head(10)

In [ ]:
bios[bios['born_country'] == 'USA']['born_region'].value_counts().tail(25)

#### Groupby function in Pandas

In [178]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso         NaN
3     Tuesday       Latte         NaN
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [179]:
coffee.groupby(['Coffee Type'])['Units Sold'].sum()

Coffee Type
Espresso    235.0
Latte       175.0
Name: Units Sold, dtype: float64

In [180]:
coffee.groupby(['Coffee Type'])['Units Sold'].mean()  # return series

Coffee Type
Espresso    39.166667
Latte       29.166667
Name: Units Sold, dtype: float64

In [183]:
coffee.groupby(['Coffee Type'])['Units Sold'].mean().reset_index() # return dataframe

  Coffee Type  Units Sold
0    Espresso   39.166667
1       Latte   29.166667

In [181]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        15.0
2     Tuesday    Espresso         NaN
3     Tuesday       Latte         NaN
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [182]:
coffee.groupby(['Coffee Type', 'Day']).agg({'Units Sold': 'sum'})

                       Units Sold
Coffee Type Day
Espresso    Friday           45.0
            Monday           25.0
            Saturday         45.0
            Sunday           45.0
            Thursday         40.0
            Tuesday           0.0
            Wednesday        35.0
Latte       Friday           35.0
            Monday           15.0
            Saturday         35.0
            Sunday           35.0
            Thursday         30.0
            Tuesday           0.0
            Wednesday        25.0

In [ ]:
coffee.groupby(['Coffee Type', 'Day']).agg({'Units Sold': 'sum', 'price': 'mean'})

#### Using datetime with Groupby

In [ ]:
bios['born_date'] = pd.to_datetime(bios['born_date'])

bios['month_born'] = bios['born_date'].dt.month

bios['year_born'] = bios['born_date'].dt.year

bios.groupby([bios['year_born'], bios['month_born']])['name'].count().reset_index().sort_values('name', ascending=False)

## Case Excercise

In [ ]:
import pandas as pd
bios = pd.read_csv('bios.csv')

In [ ]:
bios.info()

### **Task 1:** We'll filter a DataFrame to find rows where athletes were either born in New Hampshire or San Francisco. This helps in narrowing down data based on specific criteria.

### **Task 2:** Filter the bios DataFrame to include only athletes born in either 'New York' or 'Los Angeles'. Display the first 5 rows of the filtered DataFrame.

### **Task 3:** Create a dataframe with code:

In [ ]:
import pandas as pd


data = {
    'Date': ['2024-05-01', '2024-05-01', '2024-05-01', '2024-05-02', '2024-05-02', '2024-05-03', '2024-05-03', '2024-05-03'],
    'Item': ['Apple', 'Banana', 'Orange', 'Apple', 'Banana', 'Orange', 'Apple', 'Orange'],
    'Units Sold': [30, 21, 15, 40, 34, 20, 45, 25],
    'Price Per Unit': [1.0, 0.5, 0.75, 1.0, 0.5, 0.75, 1.0, 0.75],
    'Salesperson': ['John', 'John', 'John', 'Alice', 'Alice', 'John', 'Alice', 'John']
}

df = pd.DataFrame(data)


df

Add a new column to the DataFrame called Total Sales, which is calculated as Units Sold multiplied by Price Per Unit. Display the updated DataFrame.

### **Task 4:** Given the created dataframe `data_existing` and  `data_new`. Merge this DataFrame with the df_existing DataFrame on ID and name it as `df_merged`. Sort `df_merged`  by Age in ascending order and display it.

In [ ]:
import pandas as pd

data_existing = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45]
}

df_existing = pd.DataFrame(data_existing)

data_new = {
    'ID': [3, 4, 5, 6, 7],
    'Score': [88, 92, 85, 90, 95]
}

df_new = pd.DataFrame(data_new)

### **Task 5:** Given Task 4, group the `df_merged` DataFrame by Name and calculate both the sum and average of Score. Display the resulting DataFrame.